app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request)
    {
        return array_merge(parent::share($request), [
            'auth' => function () {
                return [
                    'user' => Auth::check() ? new UserResource(Auth::user()->load('account')) : null
                ];
---
select * from `accounts` where `accounts`.`id` in (1)