app/Http/Controllers/ContactsController.php

select * from `accounts` where `accounts`.`id` = 1 limit 1
select * from `organizations` where `organizations`.`id` in (4, 12, 41, 60, 70, 74, 76, 86, 90, 96) and `organizations`.`deleted_at` is null
select count(*) as aggregate from `contacts` where `contacts`.`account_id` = 1 and `contacts`.`account_id` is not null and `contacts`.`deleted_at` is null
---
    public function index()
    {
        return Inertia::render('Contacts/Index', [
            'filters' => Request::all('search', 'trashed'),
            'contacts' => new ContactCollection(
                Auth::user()->account->contacts()
                    ->with('organization')
                    ->orderByName()
                    ->filter(Request::only('search', 'trashed'))
                    ->paginate()
                    ->appends(Request::all())
            ),