app/Http/Controllers/OrganizationsController.php

    public function index()
    {
        return Inertia::render('Organizations/Index', [
            'filters' => Request::all('search', 'trashed'),
            'organizations' => new OrganizationCollection(
                Auth::user()->account->organizations()
                    ->orderBy('name')
                    ->filter(Request::only('search', 'trashed'))
                    ->paginate()
                    ->appends(Request::all())
            ),
---
select * from `organizations` where `organizations`.`account_id` = 1 and `organizations`.`account_id` is not null and `organizations`.`deleted_at` is null order by `name` asc limit 10 offset 0
select count(*) as aggregate from `organizations` where `organizations`.`account_id` = 1 and `organizations`.`account_id` is not null and `organizations`.`deleted_at` is null